tests/data/probe_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:vfdis="http://www.onvif.org/ver10/network/wsdl/RemoteDiscoveryBinding" xmlns:vfdis2="http://www.onvif.org/ver10/network/wsdl/DiscoveryLookupBinding" xmlns:tdn="http://www.onvif.org/ver10/network/wsdl">
<SOAP-ENV:Header>
    <wsa:MessageID>uuid:2419d68a-2dd2-21b2-a205-78A5DD0F9593</wsa:MessageID>
    <wsa:RelatesTo>urn:uuid:2de9f5ad-abd2-4c0e-9ba8-178098d67f01</wsa:RelatesTo>
    <wsa:To SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    <wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
    <wsdd:ProbeMatches>
        <wsdd:ProbeMatch>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:2419d68a-2dd2-21b2-a205-78A5DD0F9593</wsa:Address>
                <wsa:ReferenceProperties/>
                <wsa:ReferenceParameters/>
                <wsa:PortType>ttl</wsa:PortType>
            </wsa:EndpointReference>
            <wsdd:Scopes>onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/Model/631GA onvif://www.onvif.org/Name/IPCAM onvif://www.onvif.org/location/country/china</wsdd:Scopes>
            <wsdd:XAddrs>http://192.168.1.104:80/onvif/device_service</wsdd:XAddrs>
            <wsdd:MetadataVersion>1</wsdd:MetadataVersion>
        </wsdd:ProbeMatch>
    </wsdd:ProbeMatches>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
